{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T17:00:06.8618217Z","creationSource":null,"description":"Allow Windows Ink Workspace - Ink workspace is enabled (feature is turned on), but the user cannot access it above the lock screen.","lastModifiedDateTime":"2024-07-08T14:29:50.9166429Z","name":"Security Baseline Windows 23H2 - Security Baseline - Windows Ink Workspace","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"76979d9d-38fc-4bd1-815f-abb12c38d03c","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_windowsinkworkspace_allowwindowsinkworkspace","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_windowsinkworkspace_allowwindowsinkworkspace_1","children":[]}}}]}