{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T12:34:38.6006739Z","creationSource":null,"description":"Configure Xbox Accessory Management Service Startup Mode - Disabled\nConfigure Xbox Live Auth Manager Service Startup Mode - Disabled\nConfigure Xbox Live Game Save Service Startup Mode - Disabled\nConfigure Xbox Live Networking Service Startup Mode - Disabled\n","lastModifiedDateTime":"2024-07-08T14:34:57.275907Z","name":"Security Baseline Windows 23H2 - System Services","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":4,"technologies":"mdm","id":"0c11f116-5a18-4cf2-a052-efb689656551","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode_4","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode_4","children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode_4","children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode_4","children":[]}}}]}