{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T10:49:25.2199837Z","creationSource":null,"description":"Device Enumeration Policy - Block all (Most restrictive)","lastModifiedDateTime":"2024-07-08T14:40:38.0361445Z","name":"Security Baseline Windows 23H2 - Dma Guard","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"4741645d-91eb-4e5b-8858-adba02c7faa1","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_dmaguard_deviceenumerationpolicy","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_dmaguard_deviceenumerationpolicy_0","children":[]}}}]}