{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T08:15:29.5611031Z","creationSource":null,"description":"Allow Direct Memory Access - Block","lastModifiedDateTime":"2024-07-08T19:54:54.0260534Z","name":"Security Baseline Windows 23H2 - Data Protection - Data Protection","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"147e72be-9fc2-4358-a47f-2786acbda718","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_dataprotection_allowdirectmemoryaccess","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_dataprotection_allowdirectmemoryaccess_0","children":[]}}}]}