{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-08T01:54:51.3508739Z","creationSource":null,"description":"Java permissions - Enabled\n- Java permissions - Disable Java","lastModifiedDateTime":"2024-07-09T10:47:12.6139443Z","name":"Security Baseline Windows 23H2 - Windows Components - Internet Explorer - Internet Control Panel - Security Page - Locked-Down Local Machine Zone","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"0dd54ad2-3cea-4836-983f-857e642f8db0","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_lockeddownlocalmachinezonejavapermissions","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_lockeddownlocalmachinezonejavapermissions_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_lockeddownlocalmachinezonejavapermissions_iz_partname1c00","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_lockeddownlocalmachinezonejavapermissions_iz_partname1c00_0","children":[]}}]}}}]}