{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T12:27:37.8827565Z","creationSource":null,"description":"Notify Malicious - Enabled\nNotify Password Reuse - Enabled\nNotify Unsafe App - Enabled\nService Enabled - Enabled","lastModifiedDateTime":"2024-07-08T14:35:16.9170228Z","name":"Security Baseline Windows 23H2 - Enhanced Phishing Protection","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":4,"technologies":"mdm","id":"8f5c69d3-1a1c-4e75-b5e7-ee78719e066e","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_webthreatdefense_notifymalicious","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_webthreatdefense_notifymalicious_1","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_webthreatdefense_notifypasswordreuse","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_webthreatdefense_notifypasswordreuse_1","children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_webthreatdefense_notifyunsafeapp","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_webthreatdefense_notifyunsafeapp_1","children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_webthreatdefense_serviceenabled","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_webthreatdefense_serviceenabled_1","children":[]}}}]}