{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-09T08:51:12.9406647Z","creationSource":null,"description":"Turn off toast notifications on the lock screen (User) - Enabled","lastModifiedDateTime":"2024-07-09T09:31:19.2357937Z","name":"Security Baseline Windows 23H2 - Start Menu and Taskbar - Notifications","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"f7987c3e-46c7-4fcc-b1dc-c89188285f25","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification_1","children":[]}}}]}