{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-03T14:14:48.9771748Z","creationSource":null,"description":"Voice activate apps from locked screen - disabled\nBlock display of toast notifications - disabled","lastModifiedDateTime":"2024-07-08T19:50:11.5227005Z","name":"Security Baseline Windows 23H2 - Above Lock","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"938d2e00-826b-45a7-b25a-43e9c939b0a4","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification_0","children":[]}}}]}