{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-09T09:26:12.0153418Z","creationSource":null,"description":"Configure registry policy processing - Enabled\nDo not apply during periodic background processing (Device) - False\nProcess even if the Group Policy objects have not changed (Device) - True","lastModifiedDateTime":"2024-07-09T09:26:12.0153418Z","name":"Security Baseline Windows 23H2 - System - Group Policy","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"0e15bb3b-0249-476b-a5ab-8517d0940ed2","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_grouppolicy_cse_registry","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_cse_nobackground10","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_cse_nobackground10_0","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_cse_nochanges10","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_cse_nochanges10_1","children":[]}}]}}}]}