{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-09T09:35:31.6164215Z","creationSource":null,"description":"Allow Custom SSPs and APs to be loaded into LSASS - Disabled","lastModifiedDateTime":"2024-07-09T09:35:31.6164215Z","name":"Security Baseline Windows 23H2 - System - Local Security Authority","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"a312c9d0-f77f-4ea3-99fe-37300eea459f","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_localsecurityauthority_allowcustomsspsaps","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_localsecurityauthority_allowcustomsspsaps_0","children":[]}}}]}