{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T12:17:02.2662356Z","creationSource":null,"description":"Allow Indexing Encrypted Stores Or Items - Block","lastModifiedDateTime":"2024-07-08T14:36:09.152454Z","name":"Security Baseline Windows 23H2 - Search","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"4ba3dc13-ca0c-47e9-b453-11498f28fa9d","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_search_allowindexingencryptedstoresoritems","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_search_allowindexingencryptedstoresoritems_1","children":[]}}}]}