{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T21:55:19.6411118Z","creationSource":null,"description":"Prevent ignoring certificate errors - Enabled","lastModifiedDateTime":"2024-07-08T14:32:03.2750742Z","name":"Security Baseline Windows 23H2 - Windows Components - Internet Explorer - Internet Control Panel","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"c9a02a16-4ff0-4fb6-8e9e-04e5af935730","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_disableignoringcertificateerrors","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_disableignoringcertificateerrors_1","children":[]}}}]}