{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T12:37:07.1166551Z","creationSource":null,"description":"Enable Xbox Game Save Task - Disabled","lastModifiedDateTime":"2024-07-08T14:34:32.0541163Z","name":"Security Baseline Windows 23H2 - Task Scheduler","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"277c89f4-0f76-4a10-b4de-f8a76b217101","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_taskscheduler_enablexboxgamesavetask","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_taskscheduler_enablexboxgamesavetask_1","children":[]}}}]}