{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-09T09:39:01.1348462Z","creationSource":null,"description":"Allow standby states (S1-S3) when sleeping (on battery) - Disabled\nAllow standby states (S1-S3) when sleeping (plugged in) - Disabled\nRequire a password when a computer wakes (on battery) - Enabled\nRequire a password when a computer wakes (plugged in) - Enabled","lastModifiedDateTime":"2024-07-09T09:39:40.3567087Z","name":"Security Baseline Windows 23H2 - System > Power Management > Sleep Settings","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":4,"technologies":"mdm","id":"75bb656c-9067-4ce6-9f9a-11dd74511328","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_power_allowstandbystateswhensleepingonbattery","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_power_allowstandbystateswhensleepingonbattery_0","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_power_allowstandbywhensleepingpluggedin","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_power_allowstandbywhensleepingpluggedin_0","children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_power_requirepasswordwhencomputerwakesonbattery","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_power_requirepasswordwhencomputerwakesonbattery_1","children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_power_requirepasswordwhencomputerwakespluggedin","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_power_requirepasswordwhencomputerwakespluggedin_1","children":[]}}}]}