{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T19:29:20.9757646Z","creationSource":null,"description":"Allow software to run or install even if the signature is invalid - Disabled\nCheck for server certificate revocation - Enabled\nCheck for signatures on downloaded programs - Enabled\nDo not allow ActiveX controls to run in Protected Mode when Enhanced Protected Mode is enabled - Enabled\nTurn off encryption support - Enabled\nSecure Protocol combinations - Use TLS 1.1 and TLS 1.2\nTurn on 64-bit tab processes when running in Enhanced Protected Mode on 64-bit versions of Windows - Enabled\nTurn on Enhanced Protected Mode - Enabled","lastModifiedDateTime":"2024-07-08T14:33:25.7304114Z","name":"Security Baseline Windows 23H2 - Windows Components - Internet Explorer - Internet Control Panel - Advanced Page - 23H2","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":6,"technologies":"mdm","id":"c6efa071-cb74-4819-bc3b-d99f7b00c944","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_allowsoftwarewhensignatureisinvalid","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_allowsoftwarewhensignatureisinvalid_0","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_checkservercertificaterevocation","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_checkservercertificaterevocation_1","children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_donotallowactivexcontrolsinprotectedmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_donotallowactivexcontrolsinprotectedmode_1","children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_disableencryptionsupport","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2560","children":[]}}]}}},{"id":"4","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_disableprocessesinenhancedprotectedmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_disableprocessesinenhancedprotectedmode_1","children":[]}}},{"id":"5","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_allowenhancedprotectedmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_allowenhancedprotectedmode_1","children":[]}}}]}