{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T12:15:18.6881041Z","creationSource":null,"description":"Let Apps Activate With Voice Above Lock - Force deny. Windows apps cannot be activated by voice while the screen is locked, and users cannot change it.","lastModifiedDateTime":"2024-07-08T14:36:48.2359678Z","name":"Security Baseline Windows 23H2 - Privacy","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"2e45e8ca-ee33-4950-abc8-e0c80c817624","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_privacy_letappsactivatewithvoiceabovelock","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_privacy_letappsactivatewithvoiceabovelock_2","children":[]}}}]}