{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T07:46:41.3969524Z","creationSource":null,"description":"Network > DNS Client - Turn off multicast name resolution - Enabled\nNetwork > Network Connections - Prohibit use of Internet Connection Sharing on your DNS domain network - Enabled\nNetwork Provider - Hardened UNC Paths - Enabled\n\\\\*\\SYSVOL\tRequireMutualAuthentication=1,RequireIntegrity=1\n\\\\*\\NETLOGON\tRequireMutualAuthentication=1,RequireIntegrity=1\nNetwork > Windows Connection Manager - Prohibit connection to non-domain networks when connected to domain authenticated network - Enabled\n","lastModifiedDateTime":"2024-07-09T08:32:49.8538327Z","name":"Security Baseline Windows 23H2 - Network","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":3,"technologies":"mdm","id":"000bc656-bcc3-4656-9a34-0b86c1c30bbb","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui_1","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_connectivity_hardeneduncpaths","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_connectivity_hardeneduncpaths_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"\\\\*\\SYSVOL"}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"RequireMutualAuthentication=1,RequireIntegrity=1"}}]},{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"\\\\*\\NETLOGON"}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"RequireMutualAuthentication=1,RequireIntegrity=1"}}]}]}]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork_1","children":[]}}}]}