{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2023-08-03T09:36:44.3779267Z","creationSource":null,"description":"Allow Microsoft accounts to be optional - Enabled","lastModifiedDateTime":"2024-07-09T09:50:11.1080654Z","name":"Security Baseline Windows 23H2 - Windows Components > App runtime","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"dbace328-6e96-4558-9f16-ceec43239174","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_appruntime_allowmicrosoftaccountstobeoptional","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_appruntime_allowmicrosoftaccountstobeoptional_0","children":[]}}}]}