{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T16:54:55.3176698Z","creationSource":null,"description":"Allow Auto Connect To Wi Fi Sense Hotspots - Block\nAllow Internet Sharing- Block","lastModifiedDateTime":"2024-07-08T14:31:37.4007638Z","name":"Security Baseline Windows 23H2 - Security Baseline - Wi-Fi Settings","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":2,"technologies":"mdm","id":"18200a7d-deb0-49b4-82fe-4dec6d5d412f","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_wifi_allowautoconnecttowifisensehotspots","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_wifi_allowautoconnecttowifisensehotspots_0","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_wifi_allowinternetsharing","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_wifi_allowinternetsharing_0","children":[]}}}]}