{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-04T16:51:15.3967657Z","creationSource":null,"description":"Hypervisor Enforced Code Integrity - (Enabled with UEFI lock) Turns on Hypervisor-Protected Code Integrity with UEFI lock.","lastModifiedDateTime":"2024-07-08T14:34:02.8686714Z","name":"Security Baseline Windows 23H2 - Security Baseline - Virtualization Based Technology","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"162c30eb-b61d-47dd-9f5a-82621b5ba63b","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_virtualizationbasedtechnology_hypervisorenforcedcodeintegrity_1","children":[]}}}]}