{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-09T09:04:07.045623Z","creationSource":null,"description":"Encryption Oracle Remediation - Enabled\n- Protection Level: (Device) Force Updated Clients\nRemote host allows delegation of non-exportable credentials - Enabled","lastModifiedDateTime":"2024-07-09T09:04:07.045623Z","name":"Security Baseline Windows 23H2 - System > Credentials Delegation","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":2,"technologies":"mdm","id":"78a5ca7e-6fbe-43b4-9ee7-e440955197e6","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop_0","children":[]}}]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials_1","children":[]}}}]}