{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-08T14:03:29.8325234Z","creationSource":null,"description":"Prevent downloading of enclosures - Enabled","lastModifiedDateTime":"2024-07-08T14:03:29.8325234Z","name":"Security Baseline Windows 23H2 - Windows Components - RSS Feeds","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"d295204f-d63c-4886-a3f4-d2be6fe03571","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_internetexplorer_disableenclosuredownloading","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_internetexplorer_disableenclosuredownloading_1","children":[]}}}]}